In [3]:
import pandas as pd
import numpy as np

In [5]:
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [9]:
import pandas as pd

a=pd.Series([1,2,8,np.nan, 4,9,12])
print(a)
print(type(a))

0     1.0
1     2.0
2     8.0
3     NaN
4     4.0
5     9.0
6    12.0
dtype: float64
<class 'pandas.core.series.Series'>

In [8]:
print(type(a))

<class 'pandas.core.series.Series'>

In [11]:
t1=pd.Series(['kim','lee','park','hong'], index=['data1','data2','dat3','data4'])
print(t1)

data1     kim
data2     lee
dat3     park
data4    hong
dtype: object

In [14]:
print(t1.index)
print(t1.values)

Index(['data1', 'data2', 'dat3', 'data4'], dtype='object')
['kim' 'lee' 'park' 'hong']

In [19]:
t1

data1     kim
data2     lee
dat3     park
data4    hong
dtype: object

In [17]:
print(t1['data1'])

kim

In [18]:
print(t1[0])

kim

In [25]:
a=pd.Series(['a','b','c','d'], index=[i for i in np.arange(1,5)])

In [26]:
print(a)

1    a
2    b
3    c
4    d
dtype: object

In [29]:
a[1]

'a'

In [30]:
t2={'a1':1000,'a2':2000,'a3':300, 'a4':500}
print(type(t2))

<class 'dict'>

In [32]:
s2=pd.Series(t2)
print(s2)

a1    1000
a2    2000
a3     300
a4     500
dtype: int64

In [34]:
print(s2['a2']) #2000
print(s2[2]) #300

2000
300

In [35]:
item=['item1','item2','item3']
itemprice=[300,200,100]

s3=pd.Series(itemprice, index=item)
print(s3)

item1    300
item2    200
item3    100
dtype: int64

In [36]:
print(s3.item)

<bound method IndexOpsMixin.item of item1    300
item2    200
item3    100
dtype: int64>

In [37]:
print(s3.in0dex)

Index(['item1', 'item2', 'item3'], dtype='object')

In [38]:
print(s3.values)

[300 200 100]

In [46]:
print(s3.item)

<bound method IndexOpsMixin.item of item1    300
item2    200
item3    100
dtype: int64>

In [49]:
s3

item1    300
item2    200
item3    100
dtype: int64

In [55]:
s3.name='itemprice'
s3.index.name='item'

print(s3['item1'])

300

In [51]:
print(s3)

item
item1    300
item2    200
item3    100
Name: itemprice, dtype: int64

In [57]:
from pandas  import Series
import numpy as np

a=Series([1,2,3], index=['a1','a2','a3'], dtype=np.float32,name='data')
print(a)

a1    1.0
a2    2.0
a3    3.0
Name: data, dtype: float32

In [64]:
import pandas as pd
from pandas import Series

s3=Series([100,200,300, np.nan, 400], index=['a1','a2','a3','a4','a5'])

print(s3)

a1    100.0
a2    200.0
a3    300.0
a4      NaN
a5    400.0
dtype: float64

In [63]:
print(pd.isnull(s3))

a1    False
a2    False
a3    False
a4     True
a5    False
dtype: bool

In [67]:
pd.notnull(s3)

a1     True
a2     True
a3     True
a4    False
a5     True
dtype: bool

In [68]:
s3.isnull()

a1    False
a2    False
a3    False
a4     True
a5    False
dtype: bool

In [69]:
s3.isna()

a1    False
a2    False
a3    False
a4     True
a5    False
dtype: bool

In [72]:
import pandas as pd
from pandas import Series, DataFrame

data={'name':['hong','lee','park','kim']
      ,'age':[10,20,21,25]
      ,'addr':['서울','경기','강원','제주']
    }
data

{'name': ['hong', 'lee', 'park', 'kim'],
 'age': [10, 20, 21, 25],
 'addr': ['서울', '경기', '강원', '제주']}

In [73]:
df1=DataFrame(data)
print(df1)
print(type(df1))

   name  age addr
0  hong   10   서울
1   lee   20   경기
2  park   21   강원
3   kim   25   제주
<class 'pandas.core.frame.DataFrame'>

In [78]:
data=(np.arange(20)*10).reshape(5,4)
index=['a1','a2','a3','a4','a5']
colum=['tes1','test2','test3','test4']

df2=DataFrame(data, index=index, columns=colum)

print(df2)

    tes1  test2  test3  test4
a1     0     10     20     30
a2    40     50     60     70
a3    80     90    100    110
a4   120    130    140    150
a5   160    170    180    190

In [79]:
data1={'name':'hong','age':20}
data2={'name':'park', 'age':10}
data3={'name':'kim','age':5}

df4=DataFrame([data1, data2,data3], columns=['name','age'])
print(df4)

   name  age
0  hong   20
1  park   10
2   kim    5

In [83]:
data4=[['hong',20,np.nan]
       ,['park',35, 'male']
       ,['lee',58, 'fmale']
       ,['park',20,'male']
      ]

df5=DataFrame(data4, index=np.arange(len(data4)), columns=['name','age','addr'])
print(df5)

4
   name  age   addr
0  hong   20    NaN
1  park   35   male
2   lee   58  fmale
3  park   20   male

In [88]:
index=[ 'a'+str(i) for i in np.arange(1,10,2)]
print(index)

['a1', 'a3', 'a5', 'a7', 'a9']

In [84]:

df5=DataFrame(data4, index=[ 'a'+str(index)for index in np.arange(len(data4))]
              , columns=['name','age','addr'])
print(df5)

    name  age   addr
a0  hong   20    NaN
a1  park   35   male
a2   lee   58  fmale
a3  park   20   male

In [89]:
df5.values

array([['hong', 20, nan],
       ['park', 35, 'male'],
       ['lee', 58, 'fmale'],
       ['park', 20, 'male']], dtype=object)

In [90]:
df5.index

Index(['a0', 'a1', 'a2', 'a3'], dtype='object')

In [92]:
df5.columns

Index(['name', 'age', 'addr'], dtype='object')

In [94]:
df5.dtypes

name    object
age      int64
addr    object
dtype: object

In [98]:
df5['age']

a0    20
a1    35
a2    58
a3    20
Name: age, dtype: int64

In [99]:
df5.age

a0    20
a1    35
a2    58
a3    20
Name: age, dtype: int64

In [101]:
df5['name']+'aaa'

a0    hongaaa
a1    parkaaa
a2     leeaaa
a3    parkaaa
Name: name, dtype: object

In [104]:
print(df5['age']  )
print(df5['age']*2)

a0    20
a1    35
a2    58
a3    20
Name: age, dtype: int64
a0     40
a1     70
a2    116
a3     40
Name: age, dtype: int64

In [107]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a0 to a3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   addr    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 288.0+ bytes

In [106]:
df5.describe()

             age
count   4.000000
mean   33.250000
std    17.951323
min    20.000000
25%    20.000000
50%    27.500000
75%    40.750000
max    58.000000

In [109]:
df5

    name  age   addr
a0  hong   20    NaN
a1  park   35   male
a2   lee   58  fmale
a3  park   20   male

In [111]:
df5.head()

    name  age   addr
a0  hong   20    NaN
a1  park   35   male
a2   lee   58  fmale
a3  park   20   male

In [120]:
data=np.arange(50).reshape(25,2)

columns=['a1','a2']
index=['data'+str(index) for index in np.arange(25)]

a=DataFrame(data, columns=columns,index=index)

a.head(3)

       a1  a2
data0   0   1
data1   2   3
data2   4   5

In [121]:
a.tail(2)

        a1  a2
data23  46  47
data24  48  49

In [126]:
import pandas as pd

data={'name':['hong','kim','lee','park']
      ,'age':[10,20,25,15]
     }

df=DataFrame(data, columns=['name','age'], index=['a1','a2','a3','a4'])

df.to_csv('./sample/hello2.csv',index=False)

print('내용쓰기 완료!!')

내용쓰기 완료!!

In [127]:
df=pd.read_csv('./sample/hello.csv', index_col=False)
print(df)

   name  age
0  hong   10
1   kim   20
2   lee   25
3  park   15

In [128]:
df.head()

   name  age
0  hong   10
1   kim   20
2   lee   25
3  park   15

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [132]:
data=pd.read_csv('./data/seoul_wifi.tsv','\t',encoding='utf-8')
data.head()

    구명    유형                    지역명   설치위치(X좌표)  설치위치(Y좌표) 설치기관(회사)
0  강남구  공공기관           (재)서울산업통상진흥원  127.071755  37.495582     LGU+
1  강남구  공공기관  (재)서울산업통상진흥원서울신기술창업센타  127.038054  37.497612     LGU+
2  강남구  공공기관              U강남도시관제센터  127.040992  37.508403      강남구
3  강남구  공공기관                  강남구의회  127.064203  37.493938      강남구
4  강남구  공공기관                   강남구청  127.047502  37.517305      강남구

In [133]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2994 entries, 0 to 2993
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   구명         2994 non-null   object
 1   유형         2994 non-null   object
 2   지역명        2994 non-null   object
 3   설치위치(X좌표)  2994 non-null   float64
 4   설치위치(Y좌표)  2994 non-null   float64
 5   설치기관(회사)   2994 non-null   object
dtypes: float64(2), object(4)
memory usage: 140.5+ KB

In [136]:
# conda list

In [137]:
df

   name  age
0  hong   10
1   kim   20
2   lee   25
3  park   15

In [140]:
d1=data.head(10)

In [151]:
d1.to_excel('./sample/seoul.xls',sheet_name='s_wifi', 
            index_label=False)

d1.head()

    구명    유형                    지역명   설치위치(X좌표)  설치위치(Y좌표) 설치기관(회사)
0  강남구  공공기관           (재)서울산업통상진흥원  127.071755  37.495582     LGU+
1  강남구  공공기관  (재)서울산업통상진흥원서울신기술창업센타  127.038054  37.497612     LGU+
2  강남구  공공기관              U강남도시관제센터  127.040992  37.508403      강남구
3  강남구  공공기관                  강남구의회  127.064203  37.493938      강남구
4  강남구  공공기관                   강남구청  127.047502  37.517305      강남구

In [153]:
d1[0:3]

    구명    유형                    지역명   설치위치(X좌표)  설치위치(Y좌표) 설치기관(회사)
0  강남구  공공기관           (재)서울산업통상진흥원  127.071755  37.495582     LGU+
1  강남구  공공기관  (재)서울산업통상진흥원서울신기술창업센타  127.038054  37.497612     LGU+
2  강남구  공공기관              U강남도시관제센터  127.040992  37.508403      강남구

In [154]:
d1['구명']

0    강남구
1    강남구
2    강남구
3    강남구
4    강남구
5    강남구
6    강남구
7    강남구
8    강남구
9    강남구
Name: 구명, dtype: object

In [158]:
d1[2:5]

    구명    유형        지역명   설치위치(X좌표)  설치위치(Y좌표) 설치기관(회사)
2  강남구  공공기관  U강남도시관제센터  127.040992  37.508403      강남구
3  강남구  공공기관      강남구의회  127.064203  37.493938      강남구
4  강남구  공공기관       강남구청  127.047502  37.517305      강남구

In [160]:
d1['유형']

0    공공기관
1    공공기관
2    공공기관
3    공공기관
4    공공기관
5    공공기관
6    공공기관
7    공공기관
8    공공기관
9    공공기관
Name: 유형, dtype: object

In [181]:
import pymysql as mysql
import pandas as pd

host='127.0.0.1'
pwd='kita'
user='root'
db='employees'
conn=mysql.connect(host=host, user=user, password=pwd
               , db=db, charset='utf8'
             ,cursorclass=mysql.cursors.DictCursor)

In [183]:
df=pd.read_sql('select * from employees limit 10', conn)

df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [177]:
sql="select * from employees limit 10"

cursor= conn.cursor()
cursor.execute(sql)
data=pd.DataFrame(cursor)
print(data)

conn.close()

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [178]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      10 non-null     int64
 1   birth_date  10 non-null     object
 2   first_name  10 non-null     object
 3   last_name   10 non-null     object
 4   gender      10 non-null     object
 5   hire_date   10 non-null     object
dtypes: int64(1), object(5)
memory usage: 608.0+ bytes